In [1]:
import numpy as np 
import pandas as pd

In [2]:
df = pd.read_csv("ex1.csv")

In [3]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
obj = pd.Series([4,7,-5,3])

In [11]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [12]:
obj.array

<NumpyExtensionArray>
[np.int64(4), np.int64(7), np.int64(-5), np.int64(3)]
Length: 4, dtype: int64

In [15]:
obj2 = pd.Series([4,7,-5,3], index = ["a", "b", "c", "d"])

In [16]:
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [17]:
obj2[obj2>0]

a    4
b    7
d    3
dtype: int64

In [18]:
obj2 * 2

a     8
b    14
c   -10
d     6
dtype: int64

In [19]:
"b" in obj2

True

In [31]:
sdata = {"Ohio:": 3500, "Texas": 71000, "Oregon" : 1600, "Utah": 500}

In [32]:
obj3 = pd.Series(sdata)

In [33]:
obj3

Ohio:      3500
Texas     71000
Oregon     1600
Utah        500
dtype: int64

In [34]:
obj3.to_dict()

{'Ohio:': 3500, 'Texas': 71000, 'Oregon': 1600, 'Utah': 500}

In [38]:
states = ["California", "Ohio", "Oregon", "Texas"]

In [39]:
obj4 = pd.Series(sdata, index = states)

In [40]:
obj4

California        NaN
Ohio              NaN
Oregon         1600.0
Texas         71000.0
dtype: float64

In [41]:
pd.isna(obj4)

California     True
Ohio           True
Oregon        False
Texas         False
dtype: bool

In [43]:
pd.notna(obj4)

California    False
Ohio          False
Oregon         True
Texas          True
dtype: bool

In [44]:
obj4.isna()

California     True
Ohio           True
Oregon        False
Texas         False
dtype: bool

In [50]:
data = {"state": ["Ohio", "Ohio", "Ohio","Nevada", "Nevada", "Nevada"], 
        "year": [2000, 2001, 2002, 2003, 2002, 2003],
        "pop" : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [51]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2003, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [52]:
frame = pd.DataFrame(data)

In [54]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2003  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [55]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2003  2.4
4  Nevada  2002  2.9

In [56]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2003  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [57]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])

In [59]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2003  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [60]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [61]:
frame2.year

0    2000
1    2001
2    2002
3    2003
4    2002
5    2003
Name: year, dtype: int64

In [62]:
frame2.loc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [64]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [65]:
frame2["debt"] = 16.5

In [66]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2003  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [67]:
frame2["debt"] = np.arange(6)

In [68]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5     0
1  2001    Ohio  1.7     1
2  2002    Ohio  3.6     2
3  2003  Nevada  2.4     3
4  2002  Nevada  2.9     4
5  2003  Nevada  3.2     5

In [69]:
df1 = pd.DataFrame(np.random.randint(1, 101, size=(10, 3)), columns=['Colonna1', 'Colonna2', 'Colonna3'])

In [71]:
df1

   Colonna1  Colonna2  Colonna3
0        81         1        72
1        48        69        73
2        26        37        14
3        27        14        17
4         6        31        55
5         8        21        14
6        85         7        29
7        19        57        64
8        28        94        51
9        68        24        96

In [72]:
population = {"Ohio":{2000: 1.5, 2001: 1.7, 2002: 3.6},
              "Nevada": {2001: 2.4, 2002: 2.9}}

In [73]:
frame3 = pd.DataFrame(population)

In [74]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [75]:
frame3.index.name = "years"

In [76]:
frame3.columns.name = "states"

In [77]:
frame3

states  Ohio  Nevada
years
2000     1.5     NaN
2001     1.7     2.4
2002     3.6     2.9

In [79]:
obj5 = pd.Series([4.5, 7.2, -5.3, 3.6], index = ["d", "b", "a", "c"])

In [80]:
obj5

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [81]:
obj6 = obj5.reindex(["a", "b", "c", "d"])

In [82]:
obj6

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [83]:
obj7 = pd.Series(["blue", "purple", "yellow"], index = [0,2,4])

In [84]:
obj7

0      blue
2    purple
4    yellow
dtype: object

In [89]:
obj7.reindex(np.arange(6), method = "ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [93]:
serie1 = pd.Series(np.random.randint(1, 101, size=15))

In [94]:
indici_nulli = np.random.choice(serie1.index, size=3, replace=False)

In [95]:
serie1 = serie1.fillna(method='ffill')

C:\Users\loren\AppData\Local\Temp\ipykernel_14944\1771469987.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  serie1 = serie1.fillna(method='ffill')

In [96]:
serie1

0     51
1     85
2     97
3     85
4     77
5     76
6     95
7     74
8     29
9      5
10    83
11    76
12    50
13     3
14    28
dtype: int32

In [99]:
df1 = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index=["a", "b", "c", "d"], columns=["one", "two"])

In [101]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [100]:
df1.sum()

one    9.25
two   -5.80
dtype: float64

In [104]:
df1.sum(axis = "columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [107]:
df1.idxmax()

one    b
two    d
dtype: object

In [108]:
df1.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000